#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.webapp.azurerm_app_service.main will be created
  + resource "azurerm_app_service" "main" {
      + app_service_plan_id            = (known after apply)
      + app_settings                   = (known after apply)
      + client_affinity_enabled        = (known after apply)
      + default_site_hostname          = (known after apply)
      + enabled                        = true
      + https_only                     = false
      + id                             = (known after apply)
      + location                       = "eastus"
      + name                           = "webapp-java-eastus-dev-appservice"
      + outbound_ip_addresses          = (known after apply)
      + possible_outbound_ip_addresses = (known after apply)
      + resource_group_name            = "test-app-malcode-eastus-webapp-dev"
      + site_credential                = (known after apply)
      + source_control                 = (known after apply)
      + tags                           = {
          + "CostCentre"  = "1111"
          + "Environment" = "dev"
          + "Lob"         = "test"
          + "Owner"       = "Vineet Sharma"
          + "OwnerEmail"  = "vsharma@objectsharp.com"
          + "Project"     = "Rockhopper"
          + "malcode"     = "malcode"
        }

      + auth_settings {
          + additional_login_params        = (known after apply)
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = (known after apply)
          + enabled                        = (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = (known after apply)
          + token_store_enabled            = (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences = (known after apply)
              + client_id         = (known after apply)
              + client_secret     = (sensitive value)
            }

          + facebook {
              + app_id       = (known after apply)
              + app_secret   = (sensitive value)
              + oauth_scopes = (known after apply)
            }

          + google {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + microsoft {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + twitter {
              + consumer_key    = (known after apply)
              + consumer_secret = (sensitive value)
            }
        }

      + connection_string {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (sensitive value)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + logs {
          + application_logs {
              + azure_blob_storage {
                  + level             = (known after apply)
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }
            }

          + http_logs {
              + azure_blob_storage {
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }

              + file_system {
                  + retention_in_days = (known after apply)
                  + retention_in_mb   = (known after apply)
                }
            }
        }

      + site_config {
          + always_on                = false
          + dotnet_framework_version = "v4.0"
          + ftps_state               = (known after apply)
          + http2_enabled            = false
          + ip_restriction           = (known after apply)
          + java_container           = "TOMCAT"
          + java_container_version   = "8.5"
          + java_version             = "1.8"
          + linux_fx_version         = (known after apply)
          + local_mysql_enabled      = (known after apply)
          + managed_pipeline_mode    = (known after apply)
          + min_tls_version          = (known after apply)
          + remote_debugging_enabled = false
          + remote_debugging_version = (known after apply)
          + scm_type                 = "None"
          + websockets_enabled       = (known after apply)
          + windows_fx_version       = (known after apply)

          + cors {
              + allowed_origins     = (known after apply)
              + support_credentials = (known after apply)
            }
        }

      + storage_account {
          + access_key   = (sensitive value)
          + account_name = (known after apply)
          + mount_path   = (known after apply)
          + name         = (known after apply)
          + share_name   = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.webapp.azurerm_app_service_plan.main will be created
  + resource "azurerm_app_service_plan" "main" {
      + id                           = (known after apply)
      + kind                         = "Windows"
      + location                     = "eastus"
      + maximum_elastic_worker_count = (known after apply)
      + maximum_number_of_workers    = (known after apply)
      + name                         = "webapp-java-eastus-dev-asp"
      + resource_group_name          = "test-app-malcode-eastus-webapp-dev"
      + tags                         = {
          + "CostCentre"  = "1111"
          + "Environment" = "dev"
          + "Lob"         = "test"
          + "Owner"       = "Vineet Sharma"
          + "OwnerEmail"  = "vsharma@objectsharp.com"
          + "Project"     = "Rockhopper"
          + "malcode"     = "malcode"
        }

      + sku {
          + capacity = (known after apply)
          + size     = "B1"
          + tier     = "Basic"
        }
    }

  # module.webapp.azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "test-app-malcode-eastus-webapp-dev"
    }

  # module.webapp.module.setsecret.vault_generic_secret.app_details will be created
  + resource "vault_generic_secret" "app_details" {
      + data         = (sensitive value)
      + data_json    = (sensitive value)
      + disable_read = false
      + id           = (known after apply)
      + path         = "secret/test-app-malcode-java-dev"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on .terraform/modules/webapp/main.tf line 25, in provider "azurerm":
  25:   client_id = "${data.vault_azure_access_credentials.creds.client_id}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and one more similar warning elsewhere)

```

</details>

*Workflow: `Validate Pull Request`, Action: `hashicorpterraform-github-actions2`, Working Directory: `.`, Workspace: `dev`*
